spec/markdown_examples/custom-typ-todo.md

I copied this todo sequence from Worg. It shows a lot of power of the
built-in todo functionality. Now, let's make sure all of these are
recognized (and therefore NOT exported.)

# Sample

 * State "CANCELED"   from "INPROGRESS" [2009-12-29 Tue 22:26] \\
I gave up.
 * State "WAITING"    from ""           [2009-12-29 Tue 22:25] \\
huh?

# this one's in progress
# who am I waiting on?
# Finished this one!
# I gave up here.
# DONT be fooled by just a random word in all caps.
# todo <== this word doesn't match because the case doesn't match.
# TODOX
don't be fooled by the initial substring above!
